Gotta003/Triangularization/BLE_p2pClient/STM32_WPAN/App/app_ble.c
          case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
            {
              /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */
              BSP_LED_On(LED_GREEN);
              HW_TS_Start(BleApplicationContext.SwitchOffGPIO_timer_Id, (uint32_t)LED_ON_TIMEOUT);
              /* USER CODE END RADIO_ACTIVITY_EVENT */
            }
            break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
  #endif

          /* USER CODE BEGIN BLUE_EVT */

          /* USER CODE END BLUE_EVT */

          default:
            /* USER CODE BEGIN ecode_default */

            /* USER CODE END ecode_default */
            break;
        }
      }
      break;

    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_DISCONN_COMPLETE */

        /* USER CODE END EVT_DISCONN_COMPLETE */
        if (cc->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle)
        {
          BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
          BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;
          APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT WITH SERVER \n\r");
          handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
          handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
          P2PC_APP_Notification(&handleNotification);
        }
      }
      break; /* HCI_DISCONNECTION_COMPLETE_EVT_CODE */

    case HCI_LE_META_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_LE_META_EVENT */

        /* USER CODE END EVT_LE_META_EVENT */
        meta_evt = (evt_le_meta_event*) event_pckt->data;

        switch (meta_evt->subevent)
        {
          /* USER CODE BEGIN subevent */

          /* USER CODE END subevent */

          case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
            /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */

            /* USER CODE END EVT_LE_CONN_COMPLETE */
            /**
             * The connection is done,
             */
            connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

            /* CONNECTION WITH CLIENT */
            APP_DBG_MSG("\r\n\r**  CONNECTION COMPLETE EVENT WITH SERVER \n\r");
            handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
            handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotification);

            result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
            if (result == BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n\r");
              APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
            }
            else
            {
              APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
            }
            break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

          case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
		  {
			uint8_t *adv_report_data;
			le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

			uint8_t len_data = le_advertising_event->Advertising_Report[0].Length_Data;
			adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;

			/* RSSI grezzo appena letto */
			int8_t raw_rssi = (int8_t)*(uint8_t*)(adv_report_data + len_data);

			/* Variabile statica per conservare l'RSSI filtrato tra un'esecuzione e l'altra */
			static float filtered_rssi = 0.0f;
			static uint8_t first_sample = 1; // Flag per inizializzare il filtro al primo avvio

			uint8_t i = 0;
			uint8_t phone_found = 0;
			while (i < len_data)
			{
			  uint8_t ad_len = adv_report_data[i];
			  if (ad_len == 0) break;
			  if (i + 1 + ad_len > len_data) break;

			  uint8_t ad_type = adv_report_data[i + 1];

			  if (ad_type == 0x09 || ad_type == 0x08)
			  {
				char name_buf[32] = {0};
				uint8_t name_len = ad_len - 1;
				if (name_len > 31) name_len = 31;

				memcpy(name_buf, &adv_report_data[i + 2], name_len);

				if (strcmp(name_buf, "MyPhone") == 0)
				{
				  phone_found = 1;
				  break;
				}
			  }
			  i += ad_len + 1;
			}

			if (phone_found)
			{
			  if (first_sample)
			  {
				filtered_rssi = (float)raw_rssi;
				first_sample = 0;
			  }
			  else
			  {
				float alpha = 0.2f; // Filtro EMA
				filtered_rssi = (alpha * (float)raw_rssi) + ((1.0f - alpha) * filtered_rssi);
			  }

			  /* Memorizziamo asincronamente i dati nell'applicazione */
			  last_phone_rssi = (int8_t)filtered_rssi;

			  /* Stampa locale sulla seriale dell'ancora */
			  APP_DBG_MSG("A%d%d\n", ANCHOR_ID, (int)last_phone_rssi);

			  /* Aggiorna il payload di advertising */
			  Update_Anchor_Advertising(last_phone_rssi);
			}
		  }
		  break;

          /* USER CODE BEGIN META_EVT */

          /* USER CODE END META_EVT */

          default:
            /* USER CODE BEGIN subevent_default */

            /* USER CODE END subevent_default */
            break;
        }
      }
      break; /* HCI_LE_META_EVT_CODE */

    /* USER CODE BEGIN EVENT_PCKT */

    /* USER CODE END EVENT_PCKT */

    default:
      /* USER CODE BEGIN evt_default */

      /* USER CODE END evt_default */
      break;
  }

  return (SVCCTL_UserEvtFlowEnable);
}

APP_BLE_ConnStatus_t APP_BLE_Get_Client_Connection_Status(uint16_t Connection_Handle)
{
  if (BleApplicationContext.BleApplicationContext_legacy.connectionHandle == Connection_Handle)
  {
    return BleApplicationContext.Device_Connection_Status;
  }
  return APP_BLE_IDLE;
}
/* USER CODE BEGIN FD */
void APP_BLE_Key_Button1_Action(void)
{
#if OOB_DEMO == 0
  P2PC_APP_SW1_Button_Action();
#else
  if(P2P_Client_APP_Get_State () != APP_BLE_CONNECTED_CLIENT)
  {
    UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
  }
  else
  {
    P2PC_APP_SW1_Button_Action();
  }
#endif
}

void APP_BLE_Key_Button2_Action(void)
{
}

